openfoam-debug-step/environment/case/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

scale   1;

vertices
(
    (-0.0206  0       -0.0005)   // 0: upstream lower-left
    ( 0       0       -0.0005)   // 1: step corner top
    ( 0       0.0254  -0.0005)   // 2: step top / upper wall junction
    (-0.0206  0.0254  -0.0005)   // 3: upstream upper-left
    ( 0      -0.0254  -0.0005)   // 4: step corner bottom
    ( 0.29   -0.0254  -0.0005)   // 5: downstream lower-right
    ( 0.29    0       -0.0005)   // 6: downstream mid-right
    ( 0.29    0.0254  -0.0005)   // 7: downstream upper-right
    (-0.0206  0        0.0005)   // 8
    ( 0       0        0.0005)   // 9
    ( 0       0.0254   0.0005)   // 10
    (-0.0206  0.0254   0.0005)   // 11
    ( 0      -0.0254   0.0005)   // 12
    ( 0.29   -0.0254   0.0005)   // 13
    ( 0.29    0        0.0005)   // 14
    ( 0.29    0.0254   0.0005)   // 15
);

blocks
(
    hex (0 1 2 3 8 9 10 11) (20 25 1) simpleGrading (1 1 1)
    hex (1 6 7 2 9 14 15 10) (180 25 1) simpleGrading (1 1 1)
    hex (4 5 6 1 12 13 14 9) (180 25 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 8 11 3)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (6 7 15 14)
            (5 6 14 13)
        );
    }

    upperWall
    {
        type wall;
        faces
        (
            (3 11 10 2)
            (2 10 15 7)
        );
    }

    lowerWall
    {
        type wall;
        faces
        (
            (0 1 9 8)
            (4 12 9 1)
            (4 5 13 12)
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (1 2 7 6)
            (4 1 6 5)
            (8 9 10 11)
            (9 14 15 10)
            (12 13 14 9)
        );
    }
);
