openfoam-debug-step/environment/case/system/fvSolution
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}

solvers
{
    p
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-06;
        relTol          0.01;
    }

    pFinal
    {
        $p;
        relTol          0;
    }

    "(U|k|epsilon)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-05;
        relTol          0.1;
    }

    "(U|k|epsilon)Final"
    {
        $"(U|k|epsilon)";
        relTol          0;
    }
}

PIMPLE
{
    nCorrectors     0;
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;
}
